; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v3 - type_2 ?v2 - type_1)
 	      (pred_3 ?v5 - object ?v2 - type_1)
	      (pred_2 ?v3 - type_2 ?v8 - type_3)
	      (pred_4 ?v3 - type_2 ?v5 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v3 - type_2 ?v4 ?v7 - type_1)
       :precondition (and  (pred_1 ?v3 ?v4))
       :effect (and  (pred_1 ?v3 ?v7)
		     (not (pred_1 ?v3 ?v4))))

   (:action op_1
       :parameters (?v3 - type_2 ?v1 - object ?v6 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v6) (pred_1 ?v3 ?v6) (pred_2 ?v3 ?v8))
       :effect (and (pred_4 ?v3 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v6)) 
		    (not (pred_2 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_2 ?v1 - object ?v6 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v3 ?v1 ?v8) (pred_1 ?v3 ?v6))
       :effect (and (pred_3 ?v1 ?v6)
		    (pred_2 ?v3 ?v8)
		    (not (pred_4 ?v3 ?v1 ?v8)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_09 obj_01 - type_3
obj_05 obj_07 obj_03 - type_1
obj_06 obj_08 obj_04 - object)
(:init
(pred_1 obj_02 obj_07)
(pred_2 obj_02 obj_09)
(pred_2 obj_02 obj_01)
(pred_3 obj_06 obj_07)
(pred_3 obj_08 obj_03)
(pred_3 obj_04 obj_07)
)
(:goal
(and
(pred_3 obj_06 obj_05)
(pred_3 obj_08 obj_05)
(pred_3 obj_04 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_02 ?b obj_01))))
)
)

; plan
1. (op_1 obj_02 obj_06 obj_07 obj_09)
   deleted: (pred_3 obj_06 obj_07) (pred_2 obj_02 obj_09)
   added: (pred_4 obj_02 obj_06 obj_09)
   goals met: 0 of 3
2. (op_3 obj_02 obj_07 obj_05)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_05)
   goals met: 0 of 3
3. (op_2 obj_02 obj_06 obj_05 obj_09)
   deleted: (pred_4 obj_02 obj_06 obj_09)
   added: (pred_3 obj_06 obj_05) (pred_2 obj_02 obj_09)
   goals met: 1 of 3
4. (op_3 obj_02 obj_05 obj_03)
   deleted: (pred_1 obj_02 obj_05)
   added: (pred_1 obj_02 obj_03)
   goals met: 1 of 3
5. (op_1 obj_02 obj_08 obj_03 obj_09)
   deleted: (pred_3 obj_08 obj_03) (pred_2 obj_02 obj_09)
   added: (pred_4 obj_02 obj_08 obj_09)
   goals met: 1 of 3
6. (op_3 obj_02 obj_03 obj_05)
   deleted: (pred_1 obj_02 obj_03)
   added: (pred_1 obj_02 obj_05)
   goals met: 1 of 3
7. (op_2 obj_02 obj_08 obj_05 obj_09)
   deleted: (pred_4 obj_02 obj_08 obj_09)
   added: (pred_3 obj_08 obj_05) (pred_2 obj_02 obj_09)
   goals met: 2 of 3
8. (op_3 obj_02 obj_05 obj_07)
   deleted: (pred_1 obj_02 obj_05)
   added: (pred_1 obj_02 obj_07)
   goals met: 2 of 3
9. (op_1 obj_02 obj_04 obj_07 obj_09)
   deleted: (pred_3 obj_04 obj_07) (pred_2 obj_02 obj_09)
   added: (pred_4 obj_02 obj_04 obj_09)
   goals met: 2 of 3
10. (op_3 obj_02 obj_07 obj_05)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_05)
   goals met: 2 of 3
11. (op_2 obj_02 obj_04 obj_05 obj_09)
   deleted: (pred_4 obj_02 obj_04 obj_09)
   added: (pred_3 obj_04 obj_05) (pred_2 obj_02 obj_09)
   goals met: 3 of 3
